{
  "backend/main.mo": "Main Motoko canister defining types and CRUD logic for farmer profiles, advisories, prices, schemes, soil reports, expert queries, and authorization checks.",
  "backend/migration.mo": "Migration module that discards incompatible legacy library data and initializes empty agriculture-related maps.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing short summaries of all frontend files for documentation or build reference.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining agriculture-themed OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Base HTML entry file that loads the React application root and main script.",
  "frontend/src/App.tsx": "Top-level React component handling authentication, admin routing, profile setup, and rendering public or admin views.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Screen shown to non-admin users attempting admin access with logout support.",
  "frontend/src/components/admin/BooksManagement.tsx": "Placeholder admin component with no implemented logic.",
  "frontend/src/components/admin/BorrowingManagement.tsx": "Empty admin component awaiting implementation.",
  "frontend/src/components/admin/CropAdvisoriesManagement.tsx": "Provides CRUD UI for crop advisories using dialogs, tables, and backend mutations.",
  "frontend/src/components/admin/EventsManagement.tsx": "Empty admin component with no functional code.",
  "frontend/src/components/admin/ExpertQueriesManagement.tsx": "Manages expert queries, allowing viewing and responding through dialogs and backend mutations.",
  "frontend/src/components/admin/GovernmentSchemesManagement.tsx": "Full CRUD interface for government schemes with dialog-based add/edit actions.",
  "frontend/src/components/admin/LibrarySettings.tsx": "Empty admin component without any implemented features.",
  "frontend/src/components/admin/MandiPricesManagement.tsx": "CRUD management UI for mandi price entries with validation and backend mutations.",
  "frontend/src/components/admin/MembersManagement.tsx": "Placeholder admin component with no implemented functionality.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright, branding, and a referral link with app identifier tracking.",
  "frontend/src/components/Header.tsx": "Renders the main header with language selection, admin toggle, and login/logout handling via Internet Identity.",
  "frontend/src/components/OfflineIndicator.tsx": "Displays an alert showing that the app is offline using i18n text.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal form for creating a user profile with validation and mutation submission.",
  "frontend/src/components/public/CropAdvisoryModule.tsx": "Displays crop advisories with offline fallback and allows users to submit expert queries with optional image attachments.",
  "frontend/src/components/public/ExpertSupportModule.tsx": "Shows user-submitted expert queries and provides a dialog to submit new questions with optional images.",
  "frontend/src/components/public/GovernmentSchemesModule.tsx": "Fetches and displays government schemes with offline caching and expandable details for each scheme.",
  "frontend/src/components/public/MandiPricesModule.tsx": "Displays mandi prices with search, offline fallback, and an optional compare mode for selected items.",
  "frontend/src/components/public/SoilHealthModule.tsx": "Lists soil health reports and provides a form for authenticated users to add new soil reports.",
  "frontend/src/components/public/WeatherModule.tsx": "Shows current weather stats and a static 7‑day forecast using mock weather data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading and managing identities via AuthClient.",
  "frontend/src/hooks/useLanguagePreference.ts": "Syncs user language preference with profile data and updates profile when language changes.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls with react‑query hooks for fetching and mutating user profiles, advisories, prices, schemes, and queries.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides i18n context with language state, persistence, and translation lookup.",
  "frontend/src/i18n/strings.ts": "Contains English and Hindi translation dictionaries for UI text.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines light/dark theme CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard displaying counts and management tabs for advisories, prices, schemes, and expert queries.",
  "frontend/src/pages/PublicHome.tsx": "Renders the public homepage with module tabs (weather, advisory, prices, schemes, soil, expert) and a hero section, managing active module state and offline indicators.",
  "frontend/src/utils/imageAttachment.ts": "Provides image file validation for type and size plus a helper to convert files to base64 strings.",
  "frontend/src/utils/offlineCache.ts": "Implements localStorage-based caching with timestamps and utilities to detect offline-related errors.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, shadows, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata describing the agriculture platform’s goals, features, architecture notes, and required images."
}